#include<iostream>
#include<iomanip>
using namespace std;
int main() {
    int a, b, c, d;
    cin >> a >> b >> c >> d;
    while (d > 0) {
        c++;
        d--;
        if (c > 59) { b++;c = 0; }
        if (b > 59) { a++;b = 0; }
        if (a > 23) { a = 0; }
    }
    cout << a << " " << b << " " << c;
    return 0;
}
/**************************************************************
    문제번호: 4746
    아이디: oocjh2000
    사용언어: C++
    결과: 정확한 풀이
    수행 시간:0 ms
    메모리 사용량:1712 kb
****************************************************************/
